---
kind: property
id: P:Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.MappedDepth
source: html/5663f863-8cb7-42f7-9d25-dc5948115362.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.MappedDepth Property

The mapped size for the depth of the straight.

## Syntax (C#)
```csharp
public double MappedDepth { get; set; }
```